#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/snapshot_tf_serverless/vault-gh-actions/runs/run-6PzekgKvxizQ1ke2

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
tls_private_key.snapshot: Refreshing state... [id=82d941a20d95ff6ff322fb33d68e0cf5a117c044]
aws_vpc.snapshot: Refreshing state... [id=vpc-0c4365f2023f487b6]
aws_key_pair.snapshot: Refreshing state... [id=snapshot-ssh-key.pem]
aws_subnet.snapshot: Refreshing state... [id=subnet-04725831a8078b059]
aws_internet_gateway.snapshot: Refreshing state... [id=igw-0a7d917dfc763f5a7]
aws_security_group.snapshot: Refreshing state... [id=sg-064ae12f38313e90a]
aws_route_table.snapshot: Refreshing state... [id=rtb-090586232cc8b94de]
aws_instance.snapshot: Refreshing state... [id=i-0addfbb7804cadb32]
aws_route_table_association.snapshot: Refreshing state... [id=rtbassoc-0fb0e72087768bde6]
aws_eip.snapshot: Refreshing state... [id=eipalloc-042ffe1f52a3463b1]
aws_eip_association.snapshot: Refreshing state... [id=eipassoc-0cfbb26dc1034a2fa]
null_resource.configure-ss-app: Refreshing state... [id=1521034569039678725]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.snapshot will be updated in-place
  ~ resource "aws_eip" "snapshot" {
        id                   = "eipalloc-042ffe1f52a3463b1"
      ~ instance             = "i-0addfbb7804cadb32" -> (known after apply)
        tags                 = {}
        # (11 unchanged attributes hidden)
    }

  # aws_eip_association.snapshot must be replaced
-/+ resource "aws_eip_association" "snapshot" {
      ~ id                   = "eipassoc-0cfbb26dc1034a2fa" -> (known after apply)
      ~ instance_id          = "i-0addfbb7804cadb32" -> (known after apply) # forces replacement
      ~ network_interface_id = "eni-024125351c1498d17" -> (known after apply)
      ~ private_ip_address   = "11.0.10.94" -> (known after apply)
      ~ public_ip            = "52.79.142.102" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_instance.snapshot must be replaced
-/+ resource "aws_instance" "snapshot" {
      ~ ami                                  = "ami-0381aba5485b50aed" -> "ami-0e56d646273ad2199" # forces replacement
      ~ arn                                  = "arn:aws:ec2:ap-northeast-2:711129375688:instance/i-0addfbb7804cadb32" -> (known after apply)
      ~ availability_zone                    = "ap-northeast-2d" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0addfbb7804cadb32" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      - monitoring                           = false -> null
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ primary_network_interface_id         = "eni-024125351c1498d17" -> (known after apply)
      ~ private_dns                          = "ip-11-0-10-94.ap-northeast-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "11.0.10.94" -> (known after apply)
      ~ public_dns                           = "ec2-52-79-142-102.ap-northeast-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.79.142.102" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Billable"   = "true"
            "Department" = "devops"
            "Name"       = "snapshot-snapshot-instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0509b58182ef889de" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_vpc.snapshot will be updated in-place
  ~ resource "aws_vpc" "snapshot" {
        id                               = "vpc-0c4365f2023f487b6"
      ~ tags                             = {
          ~ "environment" = "modu_demo" -> "test"
          - "owner"       = "jsp@hashicorp.com" -> null
          - "ttl"         = "48" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all                         = {
          ~ "environment" = "modu_demo" -> "test"
          - "owner"       = "jsp@hashicorp.com" -> null
          - "ttl"         = "48" -> null
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # null_resource.configure-ss-app must be replaced
-/+ resource "null_resource" "configure-ss-app" {
      ~ id       = "1521034569039678725" -> (known after apply)
      ~ triggers = {
          - "build_number" = "2022-01-07T05:39:39Z"
        } -> (known after apply) # forces replacement
    }

Plan: 3 to add, 2 to change, 3 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 3 estimated
           $6.9888/mo -$0.79999999999999968
```

</details>

*Pusher: @jsp-hashicorp, Action: `pull_request`*